<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        PANDAS      
    </strong>
</p>

In [ ]:
import pandas as pd

dados =[
    ['Ana', 'SP', 2500],
    ['Juca', 'SP', 5000],
    ['Léo', 'RJ', 25000],
    ['Beto', 'MG', 1300],
    ['Maria', 'MG', 1800],    
]

colunas = ['Nome', 'Estado', 'Salário']

df = pd.DataFrame(dados, columns=colunas)

df.head() # 5 primeiras e 5 ultimas linhas - mas da pra fatiar

df.shape  # quantidade de linhas e colunas
df.info() # unformações dos dados - se texto ou numero
df.describe()
df.dropna()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     5 non-null      str
 1   Estado   5 non-null      str
 2   Salário  5 non-null      int64
dtypes: int64(1), str(2)
memory usage: 252.0 bytes

    Nome Estado  Salário
0    Ana     SP     2500
1   Juca     SP     5000
2    Léo     RJ    25000
3   Beto     MG     1300
4  Maria     MG     1800

In [11]:
df.to_excel('Dados_teste.xlsx',index=False)

In [14]:
cod ='cod-1015/101215'
p = cod.index('-') + 1
cod[4:]

'1015/101215'

In [16]:
df ['Salário'] > 2000

df[ df['Salário'] > 2000]

   Nome Estado  Salário
0   Ana     SP     2500
1  Juca     SP     5000
2   Léo     RJ    25000

In [53]:
display(df.groupby("Estado")["Salário"].mean().reset_index(name="Média Salarial") )

  Estado  Média Salarial
0     MG          1550.0
1     RJ         25000.0
2     SP          3750.0

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 1 — Criando uma tabela de produtos   
    </strong>
</p>

In [36]:
produtos = [
    ['Teclado', 'P', 35, 250],
    ['Monitor', 'G', 29, 1200],
    ['Ssd','P', 12, 189.55],
    ['CPU','G', 4, 25],
    ["Banco", 'G', 40, 78],
    ["Switch", 'M', 22, 45],
    ["Mouse", 'P',48, 20.89],
    ["Notebook", "G", 8, 2890.45]
]

colunas = ['Produto', 'Tamanho', 'Quantidade', 'Valor']

df1 = pd.DataFrame(produtos, columns=colunas)

df1

    Produto Tamanho  Quantidade    Valor
0   Teclado       P          35   250.00
1   Monitor       G          29  1200.00
2       Ssd       P          12   189.55
3       CPU       G           4    25.00
4     Banco       G          40    78.00
5    Switch       M          22    45.00
6     Mouse       P          48    20.89
7  Notebook       G           8  2890.45

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 2 — Visualizando as primeiras linhas
    </strong>
</p>

In [31]:
df1.head(3)

   Produto Tamanho  Quantidade    Valor
0  Teclado       P          35   250.00
1  Monitor       G          29  1200.00
2      Ssd       P          12   189.55

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 3 — Filtrando produtos caros
    </strong>
</p>

In [52]:
df1[df1['Valor']>500]
df1.describe()
df1['Valor'].max()
df1.groupby('Tamanho')['Valor'].max()

df1['Total'] = df1['Quantidade'] * df1['Valor']

df1.groupby("Tamanho").agg(
    maior_valor = ('Valor','max'),
    Maior_Qualtidade = ('Quantidade','max'),
    total_valor = ('Valor', "sum")

)

         maior_valor  Maior_Qualtidade  total_valor
Tamanho
G            2890.45                40      4193.45
M              45.00                22        45.00
P             250.00                48       460.44

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 4 — Resumo por categoria
    </strong>
</p>

In [ ]:
# display(df.groupby("Estado")["Salário"].mean(), )

# df1.groupby(('Tamanho')['Quantidade, valor'].mean(),)

display(df1.groupby('Tamanho')['Quantidade'].mean())
display(df1.groupby('Tamanho')['Valor'].mean())

print

Tamanho
G    20.250000
M    22.000000
P    31.666667
Name: Quantidade, dtype: float64

Tamanho
G    1048.3625
M      45.0000
P     153.4800
Name: Valor, dtype: float64